src/cf/Catalogs/мвв_СтраховыеРиски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>мвв_СтраховыеРиски</Name>
			<Comment>(Упр.)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСтрахования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_ВидыСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мвв_ПравилаСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоКомплексныйРиск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлементарныеРиски</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Риск</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мвв_СтраховыеРиски</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/мвв_СтраховыеРиски/Ext/ObjectModule.bsl
// Проверяет сущестуют ли ссылки по этому риску
//
// Параметры
//	Нет
//
// Возвращаемое значение:
//   Булево   – да/нет
//
Функция ПроверитьСуществуютСсылки() Экспорт
    Возврат Ложь;

	Если ЭтоНовый() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("Риск", Ссылка);
	//Запрос.Текст = 
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	Риск
	//|ИЗ
	//|	РегистрСведений.ус_ЭлементарныеРискиДСП
	//|ГДЕ
	//|	Риск = &Риск
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ ПЕРВЫЕ 1
	//|	Риск
	//|ИЗ
	//|	РегистрСведений.ус_ОбъектыИРискиДСП
	//|ГДЕ
	//|	Риск = &Риск
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ ПЕРВЫЕ 1
	//|	Риск
	//|ИЗ
	//|	РегистрСведений.ус_ПередачаДПВ
	//|ГДЕ
	//|	Риск = &Риск 
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ ПЕРВЫЕ 1
	//|	Риск
	//|ИЗ
	//|	РегистрСведений.ус_ПередачаДПИ
	//|ГДЕ
	//|	Риск = &Риск 
	// |";
	//
	Возврат ЛОЖЬ;

КонецФункции // ПроверитьСуществуютСсылки()

// Проверяет сущестует ли введенный пакет рисков по нему
//
// Параметры
//	Нет
//
// Возвращаемое значение:
//   Булево   – да/нет
//
Функция ПроверитьСуществуетПакетРисков() Экспорт
    Возврат Ложь;

	Если ЭтоНовый() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Риск", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Риск
	|ИЗ
	|	РегистрСведений.ус_ЭлементарныеРискиДСП
	|ГДЕ
	|	Риск = &Риск
	|";
	
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции // ПроверитьСуществуетПакетРисков()

// Проверяет сущестует ли вхождение в пакет рисков
//
// Параметры
//	Нет
//
// Возвращаемое значение:
//   Булево   – да/нет
//
Функция ПроверитьВхождениеВПакетРисков() Экспорт

	Если ЭтоНовый() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Риск", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Риск
	|ИЗ
	|	Справочник.ус_СтраховыеРиски.ЭлементарныеРиски
	|ГДЕ
	|	Риск = &Риск
	|";
	
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции // ПроверитьВхождениеВПакетРисков()

// Проверят все ли элементарные риски устанавлены по соответствующему 
//
// Параметры
//	Нет
//
// Возвращаемое значение:
//   <Тип.Вид>   – <описание возвращаемого значения>
//
Функция ПолучитьМассивНеСоответствияЭлементарныхРисков(МассивРисков, Реквизит) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивРисков", МассивРисков);
	Запрос.УстановитьПараметр(Реквизит, ЭтотОбъект[Реквизит]);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.мвв_СтраховыеРиски
	|ГДЕ
	|	" + Реквизит + " <> &" + Реквизит + " И
	|	Ссылка В (&МассивРисков)
	|";
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

КонецФункции // ПолучитьМассивНеСоответствияЭлементарныхРисков()

// Процедура обработчик события ПередЗаписью
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбменДанными.Загрузка И НЕ ЭтоГруппа Тогда
					
		Если НЕ ЗначениеЗаполнено(ВидСтрахования) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Не указан вид страхования!", Отказ);
		ИначеЕсли ЭтотОбъект.ВидСтрахования <> Ссылка.ВидСтрахования И ПроверитьСуществуютСсылки() Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Существуют ссылки на риск. Нельзя менять вид страхования!", Отказ);
		КонецЕсли;
						
		Если ЭтоКомплексныйРиск Тогда
					
			Если ПроверитьВхождениеВПакетРисков() Тогда
				ОбщегоНазначения.СообщитьОбОшибке("Пакет рисков не может входить в другие пакеты рисков!", Отказ);	
			КонецЕсли;
			
			МассивРисков = ЭлементарныеРиски.ВыгрузитьКолонку("Риск");
			
			Если ПолучитьМассивНеСоответствияЭлементарныхРисков(МассивРисков, "ВидСтрахования").Количество() > 0 Тогда
				ОбщегоНазначения.СообщитьОбОшибке("По списку элементарных рисков обнаруженно несоответствие вида страхования!", Отказ);
			КонецЕсли;
			
			Если ПолучитьМассивНеСоответствияЭлементарныхРисков(МассивРисков, "Правило").Количество() > 0 Тогда
				ОбщегоНазначения.СообщитьОбОшибке("По списку элементарных рисков обнаруженно несоответствие правила страхования!", Отказ);
			КонецЕсли;
		Иначе
			// очистим
			ЭлементарныеРиски.Очистить();
			
			Если ЭтотОбъект.ЭтоКомплексныйРиск <> Ссылка.ЭтоКомплексныйРиск И ПроверитьСуществуетПакетРисков() Тогда
				
				ОбщегоНазначения.СообщитьОбОшибке("Существует введенный пакет(ы) рисков в договорах. Изменение флага ""Комплексный риск"" невозможно!", Отказ);
				
			ИначеЕсли ПроверитьВхождениеВПакетРисков() Тогда 
				
				// сравним установленные виды страхования и правило в пакетах
				
				Запрос = Новый Запрос;
				Запрос.УстановитьПараметр("ВидСтрахования", ВидСтрахования);
				Запрос.УстановитьПараметр("Правило", Правило);
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Ссылка.Наименование КАК Пакет
				|ИЗ
				|	Справочник.ус_СтраховыеРиски.ЭлементарныеРиски 
				|ГДЕ
				|	Риск = &Ссылка И
				|	(Ссылка.ВидСтрахования <> &ВидСтрахования ИЛИ
				|	 Ссылка.Правило <> &Правило)
				|";
				
				РезультатЗапроса = Запрос.Выполнить();
				
				Если НЕ РезультатЗапроса.Пустой() Тогда
					
					ЗаголовокОшибки = "Обнаружено вхождение в пакеты рисков с отличающимся видом и/или правилом страхования:";
					
					Выборка = РезультатЗапроса.Выбрать();
					
					Пока Выборка.Следующий() Цикл
						
						ОбщегоНазначения.СообщитьОбОшибке(Выборка.Пакет, Отказ, ЗаголовокОшибки);
						
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
				
КонецПроцедуры // ПередЗаписью(Отказ)
